0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    location        "0";
    class           volScalarField;
    object          nut;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    CVCWall
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }

    lowerWall
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
